
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)

    Данные = Элементы.Товары.ТекущиеДанные;
    
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Отбор = Новый Структура("КлючСвязи", Данные.КлючСвязи);
    НайденыСтроки = Объект.Дефекты.НайтиСтроки(Отбор);
    Для каждого НайденнаяСтрока из НайденыСтроки Цикл
        Объект.Дефекты.Удалить(НайденнаяСтрока);
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;
		Если СтрокаТовара <> Неопределено Тогда
			СтрокаТовара.КлючСвязи = Строка(Новый УникальныйИдентификатор());
		    Элементы.Дефекты.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТовара.КлючСвязи);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
 	Данные = Элементы.Товары.ТекущиеДанные;
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;    
    
    Элементы.Дефекты.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", Данные.КлючСвязи);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока = Истина Тогда
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;
		СтрокаДефекта = Элементы.Дефекты.ТекущиеДанные;
		Если СтрокаТовара <> Неопределено И СтрокаДефекта <> Неопределено Тогда
			СтрокаДефекта.КлючСвязи = СтрокаТовара.КлючСвязи;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
    
    ТекДанные = Элементы.Товары.ТекущиеДанные;
    Если ТекДанные = Неопределено Тогда
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры      
